
define(function() {

  return [
    {
      caption: 'Прямоугольное',
      data: [
        { l: 200, r: 90 },
        { l: 200, r: 90 },
        { l: 200, r: 90 },
        { l: 200, r: 90 }
      ]
    },
    {
      caption: 'L-образное 1',
      data: [
        { l: 185, r: 90 },
        { l: 200, r: 90 },
        { l: 250, r: 90 },
        { l: 135, r: 90 },
        { l: 65, r: 270 },
        { l: 65, r: 90 },
      ]
    },
    {
      caption: 'L-образное 2',
      data: [
        { l: 200, r: 90 },
        { l: 250, r: 90 },
        { l: 135, r: 90 },
        { l: 65, r: 270 },
        { l: 65, r: 90 },
        { l: 185, r: 90 },
      ]
    },
    {
      caption: 'L-образное 3',
      data: [
        { l: 250, r: 90 },
        { l: 135, r: 90 },
        { l: 65, r: 270 },
        { l: 65, r: 90 },
        { l: 185, r: 90 },
        { l: 200, r: 90 },
      ]
    },
    {
      caption: 'L-образное 4',
      data: [
        { l: 135, r: 90 },
        { l: 65, r: 270 },
        { l: 65, r: 90 },
        { l: 185, r: 90 },
        { l: 200, r: 90 },
        { l: 250, r: 90 },
      ]
    },
    {
      caption: '5-угольное 1',
      data: [
        { l: 100, r: 90 },
        { l: 200, r: 90 },
        { l: 250, r: 90 },
        { l: 150, r: 135 },
        { l: 70.5, r: 135 },
      ]
    },
    {
      caption: '5-угольное 2',
      data: [
        { l: 200, r: 90 },
        { l: 250, r: 90 },
        { l: 150, r: 135 },
        { l: 70.5, r: 135 },
        { l: 200, r: 90 },
      ]
    },
    {
      caption: '5-угольное 3',
      data: [
        { l: 250, r: 90 },
        { l: 150, r: 135 },
        { l: 70.5, r: 135 },
        { l: 200, r: 90 },
        { l: 200, r: 90 },
      ]
    },
    {
      caption: '5-угольное 4',
      data: [
        { l: 150, r: 135 },
        { l: 70.5, r: 135 },
        { l: 200, r: 90 },
        { l: 200, r: 90 },
        { l: 250, r: 90 },
      ]
    },
  ]

})
